## 변수 선언 부분 ##
animal = {"개":"강아지",
         "공":"능소니",
         "말":"망아지",
         "소":"송아지",
         "호랑이":"개호주",
         "꿩":"꺼병이",
         "닭":"병아리",
         "매":"초고리",
         "가오리":"간자미",
         "갈치":"풀치",
         "고등어":"고도리",
         "괴도라치":"설치",
         "농어":"껄떼기",
         "웅어":"모롱이",
         "돌고기":"가사리",
         "명태":"노가리",
         "방어":"마래미",
         "숭어":"모쟁이",
         "열목어":"팽팽이",
         "잉어":"발강이",
         "전어":"전어사리",
         "청어":"굴뚝청어"};

##메인코드##
while True:
    adult = input(str(list(animal.keys())) + "중 택1")
    if adult in animal:
        print("%s => %s"%(adult, animal.get(adult)))

    elif adult == "끝":
        break

    else:
        print("다시")